benchmarks/cases/real_cases/globalBalanced/Allrun_serial

rm -rf 0.*
rm -rf processor*
rm -rf log*
blockMesh > log.blockMesh
#reactingFoam > log.reactingFoam
reactingFoam




